In [2]:
import numpy as n
import pandas as p

from datetime import datetime

In [3]:
myyear = 2015
mymonth = 1
myday = 1
myhour = 2
mymin = 50
mysec = 45

In [6]:
mydate = datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [7]:
mydate

datetime.datetime(2015, 1, 1, 2, 50, 45)

In [8]:
mydate.year # only for years

2015

In [9]:
myser = p.Series(['Nov 3, 1990', '2000-01-01',None])

In [10]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [12]:
p.to_datetime(myser, format='mixed') # will make it  1990-11-03 like this if it was before Nov 3, 1990 like this

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

YEAR MONTH DAY

In [13]:
t = p.to_datetime(myser, format='mixed')

In [18]:
t[1]

Timestamp('2000-01-01 00:00:00')

In [19]:
t[1].year # we take only year

2000

In [20]:
t

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [21]:
euro = '31-12-2023'

In [22]:
euro

'31-12-2023'

In [23]:
p.to_datetime(euro)

/var/folders/zb/zdxx2l0s57103ycrdj0qmmkc0000gn/T/ipykernel_67996/1701300744.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  p.to_datetime(euro)

Timestamp('2023-12-31 00:00:00')

In [26]:
euro1 = '10-11-2023' # day,month,year

In [27]:
p.to_datetime(euro1) # usa type time

Timestamp('2023-10-11 00:00:00')

In [28]:
p.to_datetime(euro1, dayfirst=True) # year,month,day, eu type time

Timestamp('2023-11-10 00:00:00')

In [29]:
sdate = '19--Dec--2023'

In [30]:
p.to_datetime(sdate,format='%d--%b--%Y') # to translate

Timestamp('2023-12-19 00:00:00')

In [33]:
cdate = '12th of Nov 2023'

In [34]:
p.to_datetime(cdate)

Timestamp('2023-11-12 00:00:00')

In [35]:
sales = p.read_csv('/Users/ka53/Desktop/ml/Notebooks ML Rus V10/DATA/RetailSales_BeerWineLiquor.csv')

In [36]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [38]:
sales['DATE'] = p.to_datetime(sales['DATE'])

In [40]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [42]:
sales['DATE'][32]

Timestamp('1994-09-01 00:00:00')

In [43]:
sales['DATE'][32].year

1994

In [44]:
sales = p.read_csv('/Users/ka53/Desktop/ml/Notebooks ML Rus V10/DATA/RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [45]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [47]:
sales = sales.set_index('DATE')

In [50]:
sales.resample(rule='YE').mean().head()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000

In [54]:
sales.resample(rule='YE').min().head()

            MRTSSM4453USN
DATE
1992-12-31           1509
1993-12-31           1529
1994-12-31           1505
1995-12-31           1501
1996-12-31           1652